## Create an environment 

## Activate the  environment

## We need to install a library so that we cn connect the python with the MySQL database

## pip install mysql-connector-python

##  then open the jupyter notebook

### Creating databases in MySQL

In [12]:
## create a MySQL connection

import mysql.connector as sql

connection = sql.connect(host = "localhost",
                         user = "root",
                         password = "root")

print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001EA837CBFD0>

#### so you have successfully established the connection

### 1. Creating databases

In [13]:
## creating cursor for execution

cursor = connection.cursor()

In [14]:
## query for creating a database

cursor.execute("create database rohandas2")

In [15]:
## query to see the databases present

cursor.execute("show databases")

In [16]:
## the thing is it will not show the database names as a list
## so we need to iterate

for database in cursor:
    print(database)

('information_schema',)
('mysql',)
('performance_schema',)
('rohan1',)
('rohandas1',)
('rohandas2',)
('sakila',)
('student',)
('student1',)
('student2',)
('student3',)
('sudhanshu12345',)
('sudhanshu123456',)
('supriya1',)
('supriya2',)
('supriya3',)
('sys',)
('world',)

### 2. Deleting databases

In [17]:
## deleting some databases from 

try:
    cursor.execute("drop database rohandas1")
    print("Successfully deleted the database")
except Exception as e:
    print(e)

Successfully deleted the database

In [18]:
## Again to see the databases present

cursor.execute("show databases")
for databases in cursor:
    print(databases)

('information_schema',)
('mysql',)
('performance_schema',)
('rohan1',)
('rohandas2',)
('sakila',)
('student',)
('student1',)
('student2',)
('student3',)
('sudhanshu12345',)
('sudhanshu123456',)
('supriya1',)
('supriya2',)
('supriya3',)
('sys',)
('world',)

In [19]:
## similarly we can delete multiple databses

try:
    cursor.execute("drop database sakila")
    cursor.execute("drop database student1")
    cursor.execute("drop database student2")
    cursor.execute("drop database student3")
    cursor.execute("drop database sudhanshu12345")
    cursor.execute("drop database sudhanshu123456")
    cursor.execute("drop database supriya1")
    cursor.execute("drop database supriya2")
    cursor.execute("drop database supriya3")
    print("Successfully deleted the databases")
except Exception as e:
    print(e)

Successfully deleted the databases

In [20]:
## Again to see the databases present

cursor.execute("show databases")
for databases in cursor:
    print(databases)

('information_schema',)
('mysql',)
('performance_schema',)
('rohan1',)
('rohandas2',)
('student',)
('sys',)
('world',)

### 3. Creating tables and inserting records

#### In MySQL to use any database we need to write a command in MySQL Workbench
                "use database_name"

#### to see if any tables present in the database 
                    "show tables"

In [34]:
## suppose you want to connect to any database then you need to setup a connection

import mysql.connector as con

connection = con.connect(host="localhost",
                         user="root",
                         password = "root",
                         database = "student")

print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001EA83E35B20>

In [35]:
coursor = connection.cursor()

In [36]:
coursor.execute("show tables")

for tables in coursor:
    print(tables)
    
## no output if there are no table

('studentinfo1',)

In [37]:
## creating a table

coursor.execute("create table studentinfo2(id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), subject VARCHAR(255))")

In [38]:
## to see what created

coursor.execute("show tables")

for tables in coursor:
    print(tables)

('studentinfo1',)
('studentinfo2',)

In [39]:
## inserting values in the table

query = "insert into studentinfo2 (name , subject) values(%s, %s) "
value = ('rohan','DataScience')
## here we are not giving the id value as it will start from 1 and auto increment

coursor.execute(query,value)
print("row inserted ", coursor.lastrowid)

row inserted  1

In [47]:
## to see what has inserted
coursor.execute("select * from studentinfo2")

In [48]:
lst = coursor.fetchall()
lst

[(1, 'rohan', 'DataScience')]

In [49]:
### same 

for rec in lst:
    print(rec)

(1, 'rohan', 'DataScience')

In [50]:
## similarly we can add multiple records 

query = "insert into studentinfo2 (name , subject) values(%s, %s) "
value = [('rohan','DataScience'),
         ('uttam','EVS'),
         ('suchitra','History'),
         ('anup','Physics')]

## here we have to use executemany as we are inserting miltiple values

try:
    coursor.executemany(query,value)
    print("row inserted successfully ", coursor.lastrowid)
except Exception as e:
    print(e)

row inserted successfully  2

In [51]:
coursor.execute("select * from studentinfo2")
coursor.fetchall()

[(1, 'rohan', 'DataScience'),
 (2, 'rohan', 'DataScience'),
 (3, 'uttam', 'EVS'),
 (4, 'suchitra', 'History'),
 (5, 'anup', 'Physics')]

#### Selecting by condition

In [52]:
coursor.execute("select * from studentinfo2 where subject='EVS'")
coursor.fetchall()

[(3, 'uttam', 'EVS')]

In [53]:
coursor.execute("select name from studentinfo2 where subject='Physics'")
coursor.fetchall()

[('anup',)]

In [54]:
coursor.execute("select name,subject from studentinfo2")
coursor.fetchall()

[('rohan', 'DataScience'),
 ('rohan', 'DataScience'),
 ('uttam', 'EVS'),
 ('suchitra', 'History'),
 ('anup', 'Physics')]

In [55]:
## As we can see some records are repeated so we can use distinct 

coursor.execute("select distinct name from studentinfo2")
coursor.fetchall()

[('rohan',), ('uttam',), ('suchitra',), ('anup',)]

#### Deleting a table

In [ ]:
## dropping a table
try:
    coursor.execute("drop table studentinfo1")
    print("Successfully deleted table studentinfo1")
except Exception as e:
    print(e)

In [ ]:
## dropping the table we created
try:
    coursor.execute("drop table studentinfo2")
    print("Successfully deleted table studentinfo2")
except Exception as e:
    print(e)